MaJerle/stm32f429/00-STM32F429_LIBRARIES/tm_stm32f4_pwmin.c
        if (IC2Value != 0) {
            /* Duty cycle and frequency */
            DutyCycle = ((float)TIM_GetCapture2(PWMIN_Data->__TIM) * 100) / IC2Value;
            Frequency = (float)PWMIN_Data->__TIM_Data.TimerFrequency / (float)(IC2Value * PWMIN_Data->__TIM_Data.Prescaler);

            /* Save data */
            PWMIN_Data->__Duty = DutyCycle;
            PWMIN_Data->__Freq = Frequency;
        } else {
            /* Reset data */
            DutyCycle = 0;
            Frequency = 0;
        }
    }
    if (TIM_GetITStatus(PWMIN_Data->__TIM, TIM_IT_CC2)) {
        /* Read data */

        /* Clear pending bit */
        TIM_ClearITPendingBit(PWMIN_Data->__TIM, TIM_IT_CC2);

        /* Get the Input Capture value */
        IC2Value = (float)TIM_GetCapture2(PWMIN_Data->__TIM);

        if (IC2Value != 0) {
            /* Duty cycle and frequency */
            DutyCycle = ((float)TIM_GetCapture1(PWMIN_Data->__TIM) * 100) / IC2Value;
            Frequency = (float)PWMIN_Data->__TIM_Data.TimerFrequency / (IC2Value * PWMIN_Data->__TIM_Data.Prescaler);

            /* Save data */
            PWMIN_Data->__Duty = DutyCycle;
            PWMIN_Data->__Freq = Frequency;
        } else {
            /* Reset data */
            DutyCycle = 0;
            Frequency = 0;
        }
    }

    /* Return OK */
    return TM_PWMIN_Result_Ok;
}

/* Private functions */
TM_PWMIN_Result_t
TM_PWMIN_INT_InitChannel(TM_PWMIN_t* TIM_Data, TM_PWMIN_Channel_t Channel, TM_PWMIN_PinsPack_t PinsPack) {
#ifdef TIM1
    if (TIM_Data->__TIM == TIM1) {
        return TM_PWMIN_INT_InitTIM1Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM2
    if (TIM_Data->__TIM == TIM2) {
        return TM_PWMIN_INT_InitTIM2Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM3
    if (TIM_Data->__TIM == TIM3) {
        return TM_PWMIN_INT_InitTIM3Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM4
    if (TIM_Data->__TIM == TIM4) {
        return TM_PWMIN_INT_InitTIM4Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM5
    if (TIM_Data->__TIM == TIM5) {
        return TM_PWMIN_INT_InitTIM5Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM8
    if (TIM_Data->__TIM == TIM8) {
        return TM_PWMIN_INT_InitTIM8Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM9
    if (TIM_Data->__TIM == TIM9) {
        return TM_PWMIN_INT_InitTIM9Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM10
    if (TIM_Data->__TIM == TIM10) {
        return TM_PWMIN_INT_InitTIM10Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM11
    if (TIM_Data->__TIM == TIM11) {
        return TM_PWMIN_INT_InitTIM11Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM12
    if (TIM_Data->__TIM == TIM12) {
        return TM_PWMIN_INT_InitTIM12Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM13
    if (TIM_Data->__TIM == TIM13) {
        return TM_PWMIN_INT_InitTIM13Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM14
    if (TIM_Data->__TIM == TIM14) {
        return TM_PWMIN_INT_InitTIM14Pins(Channel, PinsPack);
    }
#endif

    /* Timer is not valid */
    return TM_PWMIN_Result_TimerNotValid;
}

TM_PWMIN_Result_t
TM_PWMIN_INT_InitTIM1Pins(TM_PWMIN_Channel_t Channel, TM_PWMIN_PinsPack_t PinsPack) {
    TM_PWMIN_Result_t result = TM_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case TM_PWMIN_Channel_1:
            switch (PinsPack) {
                case TM_PWMIN_PinsPack_1:
#ifdef GPIOA
                    TM_GPIO_InitAlternate(GPIOA, GPIO_PIN_8, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM1);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                case TM_PWMIN_PinsPack_2:
#ifdef GPIOE
                    TM_GPIO_InitAlternate(GPIOE, GPIO_PIN_9, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM1);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = TM_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        case TM_PWMIN_Channel_2:
            switch (PinsPack) {
                case TM_PWMIN_PinsPack_1:
#ifdef GPIOA
                    TM_GPIO_InitAlternate(GPIOA, GPIO_PIN_9, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM1);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                case TM_PWMIN_PinsPack_2:
#ifdef GPIOE
                    TM_GPIO_InitAlternate(GPIOE, GPIO_PIN_10, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM1);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = TM_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = TM_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}

TM_PWMIN_Result_t
TM_PWMIN_INT_InitTIM2Pins(TM_PWMIN_Channel_t Channel, TM_PWMIN_PinsPack_t PinsPack) {
    TM_PWMIN_Result_t result = TM_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case TM_PWMIN_Channel_1:
            switch (PinsPack) {
                case TM_PWMIN_PinsPack_1:
#ifdef GPIOA
                    TM_GPIO_InitAlternate(GPIOA, GPIO_PIN_0, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM2);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                case TM_PWMIN_PinsPack_2:
#ifdef GPIOA
                    TM_GPIO_InitAlternate(GPIOA, GPIO_PIN_5, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM2);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                case TM_PWMIN_PinsPack_3:
#ifdef GPIOA
                    TM_GPIO_InitAlternate(GPIOA, GPIO_PIN_15, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM2);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = TM_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        case TM_PWMIN_Channel_2:
            switch (PinsPack) {
                case TM_PWMIN_PinsPack_1:
#ifdef GPIOA
                    TM_GPIO_InitAlternate(GPIOA, GPIO_PIN_1, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM2);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                case TM_PWMIN_PinsPack_2:
#ifdef GPIOB
                    TM_GPIO_InitAlternate(GPIOB, GPIO_PIN_3, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM2);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = TM_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = TM_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}

TM_PWMIN_Result_t
TM_PWMIN_INT_InitTIM3Pins(TM_PWMIN_Channel_t Channel, TM_PWMIN_PinsPack_t PinsPack) {
    TM_PWMIN_Result_t result = TM_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case TM_PWMIN_Channel_1:
            switch (PinsPack) {
                case TM_PWMIN_PinsPack_1:
#ifdef GPIOA
                    TM_GPIO_InitAlternate(GPIOA, GPIO_PIN_6, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM3);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                case TM_PWMIN_PinsPack_2:
#ifdef GPIOB
                    TM_GPIO_InitAlternate(GPIOB, GPIO_PIN_4, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM3);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                case TM_PWMIN_PinsPack_3:
#ifdef GPIOC
                    TM_GPIO_InitAlternate(GPIOC, GPIO_PIN_10, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM3);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = TM_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        case TM_PWMIN_Channel_2:
            switch (PinsPack) {
                case TM_PWMIN_PinsPack_1:
#ifdef GPIOA
                    TM_GPIO_InitAlternate(GPIOA, GPIO_PIN_7, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM3);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                case TM_PWMIN_PinsPack_2:
#ifdef GPIOB
                    TM_GPIO_InitAlternate(GPIOB, GPIO_PIN_5, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM3);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                case TM_PWMIN_PinsPack_3:
#ifdef GPIOC
                    TM_GPIO_InitAlternate(GPIOC, GPIO_PIN_7, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM3);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = TM_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = TM_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}

TM_PWMIN_Result_t
TM_PWMIN_INT_InitTIM4Pins(TM_PWMIN_Channel_t Channel, TM_PWMIN_PinsPack_t PinsPack) {
    TM_PWMIN_Result_t result = TM_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case TM_PWMIN_Channel_1:
            switch (PinsPack) {
                case TM_PWMIN_PinsPack_1:
#ifdef GPIOB
                    TM_GPIO_InitAlternate(GPIOB, GPIO_PIN_6, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM4);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                case TM_PWMIN_PinsPack_2:
#ifdef GPIOD
                    TM_GPIO_InitAlternate(GPIOD, GPIO_PIN_12, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM4);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = TM_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        case TM_PWMIN_Channel_2:
            switch (PinsPack) {
                case TM_PWMIN_PinsPack_1:
#ifdef GPIOB
                    TM_GPIO_InitAlternate(GPIOB, GPIO_PIN_7, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM4);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                case TM_PWMIN_PinsPack_2:
#ifdef GPIOD
                    TM_GPIO_InitAlternate(GPIOD, GPIO_PIN_13, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM4);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = TM_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = TM_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}

TM_PWMIN_Result_t
TM_PWMIN_INT_InitTIM5Pins(TM_PWMIN_Channel_t Channel, TM_PWMIN_PinsPack_t PinsPack) {
    TM_PWMIN_Result_t result = TM_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case TM_PWMIN_Channel_1:
            switch (PinsPack) {
                case TM_PWMIN_PinsPack_1:
#ifdef GPIOA
                    TM_GPIO_InitAlternate(GPIOA, GPIO_PIN_0, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM5);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                case TM_PWMIN_PinsPack_2:
#ifdef GPIOH
                    TM_GPIO_InitAlternate(GPIOH, GPIO_PIN_10, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM5);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = TM_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        case TM_PWMIN_Channel_2:
            switch (PinsPack) {
                case TM_PWMIN_PinsPack_1:
#ifdef GPIOA
                    TM_GPIO_InitAlternate(GPIOA, GPIO_PIN_1, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM5);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                case TM_PWMIN_PinsPack_2:
#ifdef GPIOH
                    TM_GPIO_InitAlternate(GPIOH, GPIO_PIN_11, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM5);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = TM_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = TM_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}

TM_PWMIN_Result_t
TM_PWMIN_INT_InitTIM8Pins(TM_PWMIN_Channel_t Channel, TM_PWMIN_PinsPack_t PinsPack) {
    TM_PWMIN_Result_t result = TM_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case TM_PWMIN_Channel_1:
            switch (PinsPack) {
                case TM_PWMIN_PinsPack_1:
#ifdef GPIOC
                    TM_GPIO_InitAlternate(GPIOC, GPIO_PIN_6, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM8);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                case TM_PWMIN_PinsPack_2:
#ifdef GPIOI
                    TM_GPIO_InitAlternate(GPIOI, GPIO_PIN_5, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM8);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = TM_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        case TM_PWMIN_Channel_2:
            switch (PinsPack) {
                case TM_PWMIN_PinsPack_1:
#ifdef GPIOC
                    TM_GPIO_InitAlternate(GPIOC, GPIO_PIN_7, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM8);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                case TM_PWMIN_PinsPack_2:
#ifdef GPIOI
                    TM_GPIO_InitAlternate(GPIOI, GPIO_PIN_6, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM8);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = TM_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = TM_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}

TM_PWMIN_Result_t
TM_PWMIN_INT_InitTIM9Pins(TM_PWMIN_Channel_t Channel, TM_PWMIN_PinsPack_t PinsPack) {
    TM_PWMIN_Result_t result = TM_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case TM_PWMIN_Channel_1:
            switch (PinsPack) {
                case TM_PWMIN_PinsPack_1:
#ifdef GPIOA
                    TM_GPIO_InitAlternate(GPIOA, GPIO_PIN_2, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM9);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                case TM_PWMIN_PinsPack_2:
#ifdef GPIOE
                    TM_GPIO_InitAlternate(GPIOE, GPIO_PIN_5, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM9);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = TM_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        case TM_PWMIN_Channel_2:
            switch (PinsPack) {
                case TM_PWMIN_PinsPack_1:
#ifdef GPIOA
                    TM_GPIO_InitAlternate(GPIOA, GPIO_PIN_3, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM9);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                case TM_PWMIN_PinsPack_2:
#ifdef GPIOE
                    TM_GPIO_InitAlternate(GPIOE, GPIO_PIN_6, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM9);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = TM_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = TM_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}

TM_PWMIN_Result_t
TM_PWMIN_INT_InitTIM10Pins(TM_PWMIN_Channel_t Channel, TM_PWMIN_PinsPack_t PinsPack) {
    TM_PWMIN_Result_t result = TM_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case TM_PWMIN_Channel_1:
            switch (PinsPack) {
                case TM_PWMIN_PinsPack_1:
#ifdef GPIOB
                    TM_GPIO_InitAlternate(GPIOB, GPIO_PIN_8, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM10);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                case TM_PWMIN_PinsPack_2:
#ifdef GPIOF
                    TM_GPIO_InitAlternate(GPIOF, GPIO_PIN_6, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM10);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = TM_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = TM_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}

TM_PWMIN_Result_t
TM_PWMIN_INT_InitTIM11Pins(TM_PWMIN_Channel_t Channel, TM_PWMIN_PinsPack_t PinsPack) {
    TM_PWMIN_Result_t result = TM_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case TM_PWMIN_Channel_1:
            switch (PinsPack) {
                case TM_PWMIN_PinsPack_1:
#ifdef GPIOB
                    TM_GPIO_InitAlternate(GPIOB, GPIO_PIN_9, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM11);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                case TM_PWMIN_PinsPack_2:
#ifdef GPIOF
                    TM_GPIO_InitAlternate(GPIOF, GPIO_PIN_7, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM11);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = TM_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = TM_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}

TM_PWMIN_Result_t
TM_PWMIN_INT_InitTIM12Pins(TM_PWMIN_Channel_t Channel, TM_PWMIN_PinsPack_t PinsPack) {
    TM_PWMIN_Result_t result = TM_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case TM_PWMIN_Channel_1:
            switch (PinsPack) {
                case TM_PWMIN_PinsPack_1:
#ifdef GPIOB
                    TM_GPIO_InitAlternate(GPIOB, GPIO_PIN_14, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM12);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                case TM_PWMIN_PinsPack_2:
#ifdef GPIOH
                    TM_GPIO_InitAlternate(GPIOH, GPIO_PIN_6, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM12);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = TM_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        case TM_PWMIN_Channel_2:
            switch (PinsPack) {
                case TM_PWMIN_PinsPack_1:
#ifdef GPIOB
                    TM_GPIO_InitAlternate(GPIOB, GPIO_PIN_15, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM12);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                case TM_PWMIN_PinsPack_2:
#ifdef GPIOH
                    TM_GPIO_InitAlternate(GPIOH, GPIO_PIN_9, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM12);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = TM_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = TM_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}

TM_PWMIN_Result_t
TM_PWMIN_INT_InitTIM13Pins(TM_PWMIN_Channel_t Channel, TM_PWMIN_PinsPack_t PinsPack) {
    TM_PWMIN_Result_t result = TM_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case TM_PWMIN_Channel_1:
            switch (PinsPack) {
                case TM_PWMIN_PinsPack_1:
#ifdef GPIOA
                    TM_GPIO_InitAlternate(GPIOA, GPIO_PIN_1, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM13);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                case TM_PWMIN_PinsPack_2:
#ifdef GPIOF
                    TM_GPIO_InitAlternate(GPIOF, GPIO_PIN_8, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM13);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = TM_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = TM_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}

TM_PWMIN_Result_t
TM_PWMIN_INT_InitTIM14Pins(TM_PWMIN_Channel_t Channel, TM_PWMIN_PinsPack_t PinsPack) {
    TM_PWMIN_Result_t result = TM_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case TM_PWMIN_Channel_1:
            switch (PinsPack) {
                case TM_PWMIN_PinsPack_1:
#ifdef GPIOA
                    TM_GPIO_InitAlternate(GPIOA, GPIO_PIN_7, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM14);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                case TM_PWMIN_PinsPack_2:
#ifdef GPIOF
                    TM_GPIO_InitAlternate(GPIOF, GPIO_PIN_9, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High, GPIO_AF_TIM14);
                    result = TM_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = TM_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = TM_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}
